Show / Hide Table of Contents
Class TimeAxis
Time axis
Inheritance
System.Object
OpenObject
TimeAxis
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public class TimeAxis : OpenObject
Constructors
Improve this Doc   View Source
TimeAxis()
Constructor
Declaration
public TimeAxis()
Properties
Improve this Doc   View Source
CreepTime
time from which the creep is calculated
Declaration
public double CreepTime { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Times
Times
Declaration
public List<TimePoint> Times { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<TimePoint>
 Improve this Doc
 View Source